In [2]:
import sqlalchemy as alchemy
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Date, Float, BigInteger
from sqlalchemy.orm import sessionmaker
import matplotlib.pyplot as plt
import pandas as pd 
import os

In [11]:
NOMBRE_DB = 'tp3_elt'
USUARIO_DB = os.environ.get('USUARIO_DB', 'postgres') #'gaston'
PASSWORD_DB = os.environ.get('PASSWORD_DB', 'postgres') #'gastonm1'
HOST_DB=os.environ.get('HOST_DB','localhost')
PORT_DB = os.environ.get('PORT_DB', 5432)

url_db = 'postgresql+psycopg2://%s:%s@%s:%d/'%(USUARIO_DB, PASSWORD_DB, HOST_DB, int(PORT_DB))
 
engine = alchemy.create_engine(url_db, echo=True)
try:
    conn = engine.connect()
    conn.execute("commit")
    conn.execute("create database " + NOMBRE_DB)
    conn.close()
except Exception as e:
    print str(e)
url_db = 'postgresql+psycopg2://%s:%s@%s:%d/%s'%(USUARIO_DB, PASSWORD_DB, HOST_DB, int(PORT_DB), NOMBRE_DB)

engine = alchemy.create_engine(url_db, echo=True)

2017-10-08 01:27:56,181 INFO sqlalchemy.engine.base.Engine select version()
2017-10-08 01:27:56,186 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:27:56,192 INFO sqlalchemy.engine.base.Engine select current_schema()
2017-10-08 01:27:56,197 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:27:56,204 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2017-10-08 01:27:56,205 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:27:56,208 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2017-10-08 01:27:56,210 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:27:56,215 INFO sqlalchemy.engine.base.Engine show standard_conforming_strings
2017-10-08 01:27:56,217 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:27:56,221 INFO sqlalchemy.engine.base.Engine commit
2017-10-08 01:27:56,223 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:27:56,232 INFO sqlalchemy.engine.base.Engine create database tp3_elt
2017-10-08 01:27:56,234 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:27:56,238 INFO sqlalchemy.engine.base.Engine ROLLBACK
(psycopg2.ProgrammingError) database "tp3_elt" already exists
 [SQL: 'create database tp3_elt']

In [12]:
Base = declarative_base()

In [13]:
class Ciudad(Base):
    __tablename__ = 'Ciudad'
    
    id = Column(Integer, primary_key=True)
    nombre = Column(String)
    producto = Column(Integer)

In [14]:
Base.metadata.create_all(engine)

2017-10-08 01:28:05,581 INFO sqlalchemy.engine.base.Engine select version()
2017-10-08 01:28:05,584 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:05,597 INFO sqlalchemy.engine.base.Engine select current_schema()
2017-10-08 01:28:05,604 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:05,610 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2017-10-08 01:28:05,612 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:05,616 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2017-10-08 01:28:05,623 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:05,631 INFO sqlalchemy.engine.base.Engine show standard_conforming_strings
2017-10-08 01:28:05,633 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:05,638 INFO sqlalchemy.engine.base.Engine select relname from pg_class c join pg_namespace n on n.oid=c.relnamespace where pg_catalog.pg_table_is_visible(c.oid) and relname=%(name)s
2017-10-08 01:28:05,640 INFO sqlalchemy.engine.base.Engine {'name': u'Ciudad'}
2017-10-08 01:28:05,650 INFO sqlalchemy.engine.base.Engine
CREATE TABLE "Ciudad" (
	id SERIAL NOT NULL,
	nombre VARCHAR,
	producto INTEGER,
	PRIMARY KEY (id)
)


2017-10-08 01:28:05,652 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:05,795 INFO sqlalchemy.engine.base.Engine COMMIT

## 1) Tomar datos de un archivo csv, de json y una db SQL

### Lectura SQL

In [15]:
df_ciudades = pd.read_sql("select * from \"Ciudad\"", engine, index_col='id')
df_ciudades.head(5)

2017-10-08 01:28:09,342 INFO sqlalchemy.engine.base.Engine select relname from pg_class c join pg_namespace n on n.oid=c.relnamespace where pg_catalog.pg_table_is_visible(c.oid) and relname=%(name)s
2017-10-08 01:28:09,350 INFO sqlalchemy.engine.base.Engine {'name': u'select * from "Ciudad"'}
2017-10-08 01:28:09,355 INFO sqlalchemy.engine.base.Engine select * from "Ciudad"
2017-10-08 01:28:09,359 INFO sqlalchemy.engine.base.Engine {}

Empty DataFrame
Columns: [nombre, producto]
Index: []

### Lectura CSV

In [16]:
datos_producto = 'data/MOCK_DATA-tp3-punto3-bd-producto.csv'
df_producto = pd.DataFrame.from_csv(datos_producto,sep=',',index_col='id')
df_producto.head(5)

     nombre   precio  localidad  tipoProducto
id
1    Nathan  $852.82          2             8
2    Abramo  $249.03          2             7
3   Ethelyn  $769.93          4             2
4       Von   $32.94          7             2
5   Latrena  $762.18          5            10

### Lectura JSON

In [17]:
datos_tipo_producto = 'data/MOCK_DATA-tp3-punto3-json2-tipoProducto.json'
df_tipoProducto = pd.read_json(datos_tipo_producto)
df_tipoProducto= df_tipoProducto.set_index('id')
df_tipoProducto.head(5)

                                       nombre
id
1                       Wells Fargo & Company
2   Matlin & Partners Acquisition Corporation
3                      Nabors Industries Ltd.
4              American Financial Group, Inc.
5               Axis Capital Holdings Limited

## 2) De los tres DataFrames realizar join, merge, concat, append, con una clave a eleccion.

In [18]:
frames = [df_ciudades, df_producto, df_tipoProducto]

In [19]:
resultConcatenacion = pd.concat(frames)
resultConcatenacion.head(5)

    localidad   nombre   precio producto  tipoProducto
id
1         2.0   Nathan  $852.82      NaN           8.0
2         2.0   Abramo  $249.03      NaN           7.0
3         4.0  Ethelyn  $769.93      NaN           2.0
4         7.0      Von   $32.94      NaN           2.0
5         5.0  Latrena  $762.18      NaN          10.0

In [20]:
resultMerge = pd.merge(df_producto, df_ciudades)
resultMerge.head(5)

Empty DataFrame
Columns: [nombre, precio, localidad, tipoProducto, producto]
Index: []

In [21]:
datos_producto2 = 'data/MOCK_DATA-tp3-punto3-bd-producto2.csv'
df_producto2 = pd.DataFrame.from_csv(datos_producto2,sep=',',index_col='id')
df_producto2.head(5)

      nombre   precio  localidad  tipoProducto
id
1       Ferd  $188.24          3             8
2     Nollie  $584.78          3             8
3      Kelly  $887.78          8             7
4       Vick  $651.07          5             4
5   Rosaleen  $131.19          9             7

In [22]:
resultAppend = df_producto.append(df_producto2)
resultAppend.head(5)

     nombre   precio  localidad  tipoProducto
id
1    Nathan  $852.82          2             8
2    Abramo  $249.03          2             7
3   Ethelyn  $769.93          4             2
4       Von   $32.94          7             2
5   Latrena  $762.18          5            10

In [23]:
resultadoJoinAll=pd.merge(df_producto, df_producto2, how='outer')
resultadoJoinAll.head(5)

    nombre   precio  localidad  tipoProducto
0   Nathan  $852.82          2             8
1   Abramo  $249.03          2             7
2  Ethelyn  $769.93          4             2
3      Von   $32.94          7             2
4  Latrena  $762.18          5            10

## 3) Guardar en una db SQL, la interseccion de los datos obtenidos en el punto anterior.

In [24]:
#DataFrame.to_sql(name, con[, flavor, ...])	Write records stored in a DataFrame to a SQL database.
resultadoJoinAll.to_sql('resultadoJoinAll', engine,if_exists='replace')
resultAppend.to_sql('resultadoAppend', engine, if_exists='replace')
resultConcatenacion.to_sql('resultadoConcatenacion', engine, if_exists='replace')
resultMerge.to_sql('resultadoMerge', engine, if_exists='replace')

2017-10-08 01:28:30,696 INFO sqlalchemy.engine.base.Engine select relname from pg_class c join pg_namespace n on n.oid=c.relnamespace where pg_catalog.pg_table_is_visible(c.oid) and relname=%(name)s
2017-10-08 01:28:30,697 INFO sqlalchemy.engine.base.Engine {'name': u'resultadoJoinAll'}
2017-10-08 01:28:30,714 INFO sqlalchemy.engine.base.Engine
CREATE TABLE "resultadoJoinAll" (
	index BIGINT,
	nombre TEXT,
	precio TEXT,
	localidad BIGINT,
	"tipoProducto" BIGINT
)


2017-10-08 01:28:30,724 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:30,810 INFO sqlalchemy.engine.base.Engine COMMIT
2017-10-08 01:28:30,868 INFO sqlalchemy.engine.base.Engine CREATE INDEX "ix_resultadoJoinAll_index" ON "resultadoJoinAll" (index)
2017-10-08 01:28:30,870 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:30,933 INFO sqlalchemy.engine.base.Engine COMMIT
2017-10-08 01:28:30,965 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2017-10-08 01:28:31,011 INFO sqlalchemy.engine.base.Engine INSERT INTO "resultadoJoinAll" (index, nombre, precio, localidad, "tipoProducto") VALUES (%(index)s, %(nombre)s, %(precio)s, %(localidad)s, %(tipoProducto)s)
2017-10-08 01:28:31,013 INFO sqlalchemy.engine.base.Engine ({'localidad': 2, 'index': 0, 'precio': '$852.82', 'tipoProducto': 8, 'nombre': 'Nathan'}, {'localidad': 2, 'index': 1, 'precio': '$249.03', 'tipoProducto': 7, 'nombre': 'Abramo'}, {'localidad': 4, 'index': 2, 'precio': '$769.93', 'tipoProducto': 2, 'nombre': 'Ethelyn'}, {'localidad': 7, 'index': 3, 'precio': '$32.94', 'tipoProducto': 2, 'nombre': 'Von'}, {'localidad': 5, 'index': 4, 'precio': '$762.18', 'tipoProducto': 10, 'nombre': 'Latrena'}, {'localidad': 3, 'index': 5, 'precio': '$511.36', 'tipoProducto': 9, 'nombre': 'Ancell'}, {'localidad': 5, 'index': 6, 'precio': '$416.98', 'tipoProducto': 2, 'nombre': 'Boy'}, {'localidad': 10, 'index': 7, 'precio': '$255.66', 'tipoProducto': 8, 'nombre': 'Holly-anne'}  ... displaying 10 of 2000 total bound parameter sets ...  {'localidad': 6, 'index': 1998, 'precio': '$778.73', 'tipoProducto': 1, 'nombre': 'Pincus'}, {'localidad': 4, 'index': 1999, 'precio': '$761.92', 'tipoProducto': 5, 'nombre': 'Gard'})
2017-10-08 01:28:31,312 INFO sqlalchemy.engine.base.Engine COMMIT
2017-10-08 01:28:31,327 INFO sqlalchemy.engine.base.Engine SELECT c.relname FROM pg_class c JOIN pg_namespace n ON n.oid = c.relnamespace WHERE n.nspname = %(schema)s AND c.relkind = 'r'
2017-10-08 01:28:31,328 INFO sqlalchemy.engine.base.Engine {'schema': u'public'}
2017-10-08 01:28:31,349 INFO sqlalchemy.engine.base.Engine select relname from pg_class c join pg_namespace n on n.oid=c.relnamespace where pg_catalog.pg_table_is_visible(c.oid) and relname=%(name)s
2017-10-08 01:28:31,354 INFO sqlalchemy.engine.base.Engine {'name': u'resultadoAppend'}
2017-10-08 01:28:31,361 INFO sqlalchemy.engine.base.Engine
CREATE TABLE "resultadoAppend" (
	id BIGINT,
	nombre TEXT,
	precio TEXT,
	localidad BIGINT,
	"tipoProducto" BIGINT
)


2017-10-08 01:28:31,364 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:31,401 INFO sqlalchemy.engine.base.Engine COMMIT
2017-10-08 01:28:31,415 INFO sqlalchemy.engine.base.Engine CREATE INDEX "ix_resultadoAppend_id" ON "resultadoAppend" (id)
2017-10-08 01:28:31,416 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:31,446 INFO sqlalchemy.engine.base.Engine COMMIT
2017-10-08 01:28:31,460 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2017-10-08 01:28:31,506 INFO sqlalchemy.engine.base.Engine INSERT INTO "resultadoAppend" (id, nombre, precio, localidad, "tipoProducto") VALUES (%(id)s, %(nombre)s, %(precio)s, %(localidad)s, %(tipoProducto)s)
2017-10-08 01:28:31,507 INFO sqlalchemy.engine.base.Engine ({'localidad': 2, 'nombre': 'Nathan', 'precio': '$852.82', 'id': 1, 'tipoProducto': 8}, {'localidad': 2, 'nombre': 'Abramo', 'precio': '$249.03', 'id': 2, 'tipoProducto': 7}, {'localidad': 4, 'nombre': 'Ethelyn', 'precio': '$769.93', 'id': 3, 'tipoProducto': 2}, {'localidad': 7, 'nombre': 'Von', 'precio': '$32.94', 'id': 4, 'tipoProducto': 2}, {'localidad': 5, 'nombre': 'Latrena', 'precio': '$762.18', 'id': 5, 'tipoProducto': 10}, {'localidad': 3, 'nombre': 'Ancell', 'precio': '$511.36', 'id': 6, 'tipoProducto': 9}, {'localidad': 5, 'nombre': 'Boy', 'precio': '$416.98', 'id': 7, 'tipoProducto': 2}, {'localidad': 10, 'nombre': 'Holly-anne', 'precio': '$255.66', 'id': 8, 'tipoProducto': 8}  ... displaying 10 of 2000 total bound parameter sets ...  {'localidad': 6, 'nombre': 'Pincus', 'precio': '$778.73', 'id': 999, 'tipoProducto': 1}, {'localidad': 4, 'nombre': 'Gard', 'precio': '$761.92', 'id': 1000, 'tipoProducto': 5})
2017-10-08 01:28:31,943 INFO sqlalchemy.engine.base.Engine COMMIT
2017-10-08 01:28:31,967 INFO sqlalchemy.engine.base.Engine SELECT c.relname FROM pg_class c JOIN pg_namespace n ON n.oid = c.relnamespace WHERE n.nspname = %(schema)s AND c.relkind = 'r'
2017-10-08 01:28:31,968 INFO sqlalchemy.engine.base.Engine {'schema': u'public'}
2017-10-08 01:28:31,983 INFO sqlalchemy.engine.base.Engine select relname from pg_class c join pg_namespace n on n.oid=c.relnamespace where pg_catalog.pg_table_is_visible(c.oid) and relname=%(name)s
2017-10-08 01:28:31,984 INFO sqlalchemy.engine.base.Engine {'name': u'resultadoConcatenacion'}
2017-10-08 01:28:31,989 INFO sqlalchemy.engine.base.Engine
CREATE TABLE "resultadoConcatenacion" (
	id BIGINT,
	localidad FLOAT(53),
	nombre TEXT,
	precio TEXT,
	producto FLOAT(53),
	"tipoProducto" FLOAT(53)
)


2017-10-08 01:28:31,993 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:32,047 INFO sqlalchemy.engine.base.Engine COMMIT
2017-10-08 01:28:32,065 INFO sqlalchemy.engine.base.Engine CREATE INDEX "ix_resultadoConcatenacion_id" ON "resultadoConcatenacion" (id)
2017-10-08 01:28:32,066 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:32,103 INFO sqlalchemy.engine.base.Engine COMMIT
2017-10-08 01:28:32,124 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2017-10-08 01:28:32,173 INFO sqlalchemy.engine.base.Engine INSERT INTO "resultadoConcatenacion" (id, localidad, nombre, precio, producto, "tipoProducto") VALUES (%(id)s, %(localidad)s, %(nombre)s, %(precio)s, %(producto)s, %(tipoProducto)s)
2017-10-08 01:28:32,175 INFO sqlalchemy.engine.base.Engine ({'producto': None, 'precio': '$852.82', 'localidad': 2.0, 'nombre': 'Nathan', 'id': 1, 'tipoProducto': 8.0}, {'producto': None, 'precio': '$249.03', 'localidad': 2.0, 'nombre': 'Abramo', 'id': 2, 'tipoProducto': 7.0}, {'producto': None, 'precio': '$769.93', 'localidad': 4.0, 'nombre': 'Ethelyn', 'id': 3, 'tipoProducto': 2.0}, {'producto': None, 'precio': '$32.94', 'localidad': 7.0, 'nombre': 'Von', 'id': 4, 'tipoProducto': 2.0}, {'producto': None, 'precio': '$762.18', 'localidad': 5.0, 'nombre': 'Latrena', 'id': 5, 'tipoProducto': 10.0}, {'producto': None, 'precio': '$511.36', 'localidad': 3.0, 'nombre': 'Ancell', 'id': 6, 'tipoProducto': 9.0}, {'producto': None, 'precio': '$416.98', 'localidad': 5.0, 'nombre': 'Boy', 'id': 7, 'tipoProducto': 2.0}, {'producto': None, 'precio': '$255.66', 'localidad': 10.0, 'nombre': 'Holly-anne', 'id': 8, 'tipoProducto': 8.0}  ... displaying 10 of 2000 total bound parameter sets ...  {'producto': None, 'precio': None, 'localidad': None, 'nombre': u'AmTrust Financial Services, Inc.', 'id': 999, 'tipoProducto': None}, {'producto': None, 'precio': None, 'localidad': None, 'nombre': u'First Trust Latin America AlphaDEX Fund', 'id': 1000, 'tipoProducto': None})
2017-10-08 01:28:32,590 INFO sqlalchemy.engine.base.Engine COMMIT
2017-10-08 01:28:32,606 INFO sqlalchemy.engine.base.Engine SELECT c.relname FROM pg_class c JOIN pg_namespace n ON n.oid = c.relnamespace WHERE n.nspname = %(schema)s AND c.relkind = 'r'
2017-10-08 01:28:32,609 INFO sqlalchemy.engine.base.Engine {'schema': u'public'}
2017-10-08 01:28:32,616 INFO sqlalchemy.engine.base.Engine select relname from pg_class c join pg_namespace n on n.oid=c.relnamespace where pg_catalog.pg_table_is_visible(c.oid) and relname=%(name)s
2017-10-08 01:28:32,618 INFO sqlalchemy.engine.base.Engine {'name': u'resultadoMerge'}
2017-10-08 01:28:32,625 INFO sqlalchemy.engine.base.Engine
CREATE TABLE "resultadoMerge" (
	index TEXT,
	nombre TEXT,
	precio TEXT,
	localidad BIGINT,
	"tipoProducto" BIGINT,
	producto TEXT
)

2017-10-08 01:28:32,628 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:32,670 INFO sqlalchemy.engine.base.Engine COMMIT
2017-10-08 01:28:32,684 INFO sqlalchemy.engine.base.Engine CREATE INDEX "ix_resultadoMerge_index" ON "resultadoMerge" (index)
2017-10-08 01:28:32,685 INFO sqlalchemy.engine.base.Engine {}
2017-10-08 01:28:32,727 INFO sqlalchemy.engine.base.Engine COMMIT
2017-10-08 01:28:32,741 INFO sqlalchemy.engine.base.Engine SELECT c.relname FROM pg_class c JOIN pg_namespace n ON n.oid = c.relnamespace WHERE n.nspname = %(schema)s AND c.relkind = 'r'
2017-10-08 01:28:32,743 INFO sqlalchemy.engine.base.Engine {'schema': u'public'}